In [1]:
%load_ext sql

In [2]:
import json
with open('/home/shadowleaf/.local/config/mysql_config.json') as f:
  data = json.load(f)

In [4]:
import os
DATABASE_URL = 'mysql+pymysql://{}:{}@localhost:3306/students'.format(data['user'], data['password'])
os.environ['DATABASE_URL'] = DATABASE_URL

In [5]:
%sql SHOW DATABASES

5 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('students',),
 ('sys',)]

In [6]:
%sql USE students;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
0 rows affected.

[]

# Create Table employee and insert data into it

In [ ]:
-- if the table already exists then drop it

DROP TABLE IF EXISTS `employee`;

-- create a table with the attributes

CREATE TABLE `employee` (
  `emp_id` int(11) DEFAULT NULL,
  `mgr_id` char(20) DEFAULT NULL,
  `dept_id` char(50) DEFAULT NULL,
  `emp_name`,
  `emp_type`,
  `last_paid_on`
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- insert data into the table

LOCK TABLES `student_list` WRITE;
INSERT INTO `student_list` VALUES
    (101,'satyajit ghana','bangalore'),
    (102,'shikhar singh','bangalore'),
    (103,'shubham agarwal','haryana'),
    (104,'pritam das','kolkata');
UNLOCK TABLES;

# Create Table salary and insert data into it

In [18]:
%%sql

-- if the table already exists then drop it

DROP TABLE IF EXISTS `salary`;

-- create a table with the attributes

CREATE TABLE `salary` (
  `sal_emp_id` int DEFAULT NULL,
  `salary_type` char(20) DEFAULT NULL,
  `base_salary` int DEFAULT 0,
  `gross_salary` int DEFAULT 0,
  `allowance` int DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- insert data into the table

LOCK TABLES `salary` WRITE;
INSERT INTO `salary` VALUES
    (101, 'junior', 1000, 20000, 5000),
    (102, 'senior', 2000, 40000,6000),
    (103, 'junior', 1500, 25000,4500),
    (104, 'senior', 2500, 35000,6000),
    (105, 'junior', 2000, 40000,6000)
    ;
UNLOCK TABLES;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
0 rows affected.
0 rows affected.
0 rows affected.
5 rows affected.
0 rows affected.

[]

In [19]:
%%sql

SELECT * FROM salary;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
5 rows affected.

[(101, 'junior', 1000, 20000, 5000),
 (102, 'senior', 2000, 40000, 6000),
 (103, 'junior', 1500, 25000, 4500),
 (104, 'senior', 2500, 35000, 6000),
 (105, 'junior', 2000, 40000, 6000)]

# Aggregate Functions

In [20]:
%%sql
SELECT
    COUNT(*), 
    AVG(base_salary),
    SUM(allowance),
    MIN(gross_salary),
    MAX(gross_salary)  FROM `salary`

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
1 rows affected.

[(5, Decimal('1800.0000'), Decimal('27500'), 20000, 40000)]